app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "to_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Lorem ipsum"], ["created_at", Fri, 24 Jan 2014 20:59:32 UTC +00:00], ["to_id", nil], ["updated_at", Fri, 24 Jan 2014 20:59:32 UTC +00:00], ["user_id", 92]]
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save