app/controllers/sessions_controller.rb

    def create
        @title = "Sign in"
        user = User.find_by_email(params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = '' LIMIT 1