app/controllers/users_controller.rb

   def index
      @title = "All users"
      # @users = params[:query].blank? ? User.paginate(page: params[:page]) :
      #                         User.search(Riddle.escape(params[:query]),
      #                         :rank_mode => :bm25,
      #                         :match_mode => :any,
      #                         :star => true,
      #                         :limit => 35,).paginate(page: params[:page])
      @users = params[:query].blank? ? User.paginate(page: params[:page]) :
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

   def show
      @user = User.find(params[:id])
      @microposts = params[:query].blank? ? @user.microposts.paginate(page: params[:page]) :
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "67"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 102 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 67

  def create
     @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "nickname", "password_digest", "remember_token", "salt", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

   def update
      @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "86"]]
UPDATE "users" SET "name" = 'New Name', "nickname" = 'Test', "email" = 'new@example.com', "password_digest" = '$2a$04$bdS/QmlNNqb1hKY8r2TC2.4aApSMcWZzwgCig1Ii56MBoDdUUVDKW', "remember_token" = 'EMe5_YrWuqhJbOGAr4fxaw', "updated_at" = '2014-01-24 20:59:42.261542' WHERE "users"."id" = 164

  def destroy
    user = User.find(params[:id])
    unless current_user?(user)
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "89"]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 150]]